# 数据清理

In [1]:
import pandas as pd
import numpy as np

## 用stack清理变量值作为列名

In [6]:
state_fruit = pd.read_csv('state_fruit.csv', index_col=0)
state_fruit

         Apple  Orange  Banana
Texas       12      10      40
Arizona      9       7      12
Florida      0      14     190

In [7]:
# stack 方法可以将所有列名，转变为垂直的一级行索引
state_fruit.stack()

Texas    Apple      12
         Orange     10
         Banana     40
Arizona  Apple       9
         Orange      7
         Banana     12
Florida  Apple       0
         Orange     14
         Banana    190
dtype: int64

In [8]:
# 使用reset_index()， 将结果变为dataframe
state_fruit_tidy = state_fruit.stack().reset_index()
state_fruit_tidy

   level_0 level_1    0
0    Texas   Apple   12
1    Texas  Orange   10
2    Texas  Banana   40
3  Arizona   Apple    9
4  Arizona  Orange    7
5  Arizona  Banana   12
6  Florida   Apple    0
7  Florida  Orange   14
8  Florida  Banana  190

In [9]:
# 重命名列名
state_fruit_tidy.columns = ['state', 'fruit', 'weight']
state_fruit_tidy

     state   fruit  weight
0    Texas   Apple      12
1    Texas  Orange      10
2    Texas  Banana      40
3  Arizona   Apple       9
4  Arizona  Orange       7
5  Arizona  Banana      12
6  Florida   Apple       0
7  Florida  Orange      14
8  Florida  Banana     190

In [10]:
# 也可以使用rename_axis给不同的行索引层级命名
state_fruit.stack() .rename_axis(['state', 'fruit'])

state    fruit
Texas    Apple      12
         Orange     10
         Banana     40
Arizona  Apple       9
         Orange      7
         Banana     12
Florida  Apple       0
         Orange     14
         Banana    190
dtype: int64

In [12]:
state_fruit.stack() .rename_axis(['state', 'fruit']).index

MultiIndex([(  'Texas',  'Apple'),
            (  'Texas', 'Orange'),
            (  'Texas', 'Banana'),
            ('Arizona',  'Apple'),
            ('Arizona', 'Orange'),
            ('Arizona', 'Banana'),
            ('Florida',  'Apple'),
            ('Florida', 'Orange'),
            ('Florida', 'Banana')],
           names=['state', 'fruit'])

In [11]:
state_fruit.stack().rename_axis(['state', 'fruit']).reset_index(name='weight')  
# reset_index()：这会将当前的多层索引（state 和 fruit）转化为普通的列，并且重新生成一个默认的整数索引。
# 并会把原来的数据值（即 stack() 操作后的数据）放到新的列中，并命名为 'weight'

     state   fruit  weight
0    Texas   Apple      12
1    Texas  Orange      10
2    Texas  Banana      40
3  Arizona   Apple       9
4  Arizona  Orange       7
5  Arizona  Banana      12
6  Florida   Apple       0
7  Florida  Orange      14
8  Florida  Banana     190

In [13]:
state_fruit2 = pd.read_csv('state_fruit2.csv')
state_fruit2

     State  Apple  Orange  Banana
0    Texas     12      10      40
1  Arizona      9       7      12
2  Florida      0      14     190

In [14]:
# state 不在行索引的位置上，使用stack将所有列名变为一个长series
state_fruit2.stack()

0  State       Texas
   Apple          12
   Orange         10
   Banana         40
1  State     Arizona
   Apple           9
   Orange          7
   Banana         12
2  State     Florida
   Apple           0
   Orange         14
   Banana        190
dtype: object

In [15]:
# 先设置state作为行索引名，再stack，可以得到和前面相似的结果
state_fruit2.set_index('State').stack()

State
Texas    Apple      12
         Orange     10
         Banana     40
Arizona  Apple       9
         Orange      7
         Banana     12
Florida  Apple       0
         Orange     14
         Banana    190
dtype: int64

## 用melt清理变量值作为列名

In [16]:
tate_fruit2 = pd.read_csv('state_fruit2.csv')
state_fruit2

     State  Apple  Orange  Banana
0    Texas     12      10      40
1  Arizona      9       7      12
2  Florida      0      14     190

In [17]:
# 使用melt方法，将列传给id_vars和value_vars。melt可以将原先的列名作为变量，原先的值作为值
state_fruit2.melt(id_vars=['State'],  value_vars=['Apple', 'Orange', 'Banana'])

     State variable  value
0    Texas    Apple     12
1  Arizona    Apple      9
2  Florida    Apple      0
3    Texas   Orange     10
4  Arizona   Orange      7
5  Florida   Orange     14
6    Texas   Banana     40
7  Arizona   Banana     12
8  Florida   Banana    190

In [18]:
# 随意设定一个行索引
state_fruit2.index=list('abc')
state_fruit2.index.name = 'letter'
state_fruit2

          State  Apple  Orange  Banana
letter
a         Texas     12      10      40
b       Arizona      9       7      12
c       Florida      0      14     190

In [19]:
# id_vars 参数指定了 State列 在转换后将作为标识列保留
# value_vars 参数指定了 'Apple', 'Orange', 'Banana' 是需要被转化为长格式的数据列
# var_name 参数指定了转换后新生成的列的名称 Fruit
# value_name 参数指定了新生成的列的名称 Weight
state_fruit2.melt(id_vars=['State'],  value_vars=['Apple', 'Orange', 'Banana'],  var_name='Fruit',  value_name='Weight')

     State   Fruit  Weight
0    Texas   Apple      12
1  Arizona   Apple       9
2  Florida   Apple       0
3    Texas  Orange      10
4  Arizona  Orange       7
5  Florida  Orange      14
6    Texas  Banana      40
7  Arizona  Banana      12
8  Florida  Banana     190

In [20]:
# 直接使用melt，将值放一列，标签放一列
state_fruit2.melt()

   variable    value
0     State    Texas
1     State  Arizona
2     State  Florida
3     Apple       12
4     Apple        9
5     Apple        0
6    Orange       10
7    Orange        7
8    Orange       14
9    Banana       40
10   Banana       12
11   Banana      190

In [21]:
# 要指明id变量，只需使用id_vars参数
state_fruit2.melt(id_vars='State')

     State variable  value
0    Texas    Apple     12
1  Arizona    Apple      9
2  Florida    Apple      0
3    Texas   Orange     10
4  Arizona   Orange      7
5  Florida   Orange     14
6    Texas   Banana     40
7  Arizona   Banana     12
8  Florida   Banana    190

## 同时stack多组变量

In [4]:
movie = pd.read_csv('movie (1).csv')
actor = movie[['movie_title',
                'actor_1_name', 'actor_2_name', 'actor_3_name',
                'actor_1_facebook_likes',
                'actor_2_facebook_likes',
                'actor_3_facebook_likes']]
actor.head()

,movie_title,actor_1_name,actor_2_name,actor_3_name,actor_1_facebook_likes,actor_2_facebook_likes,actor_3_facebook_likes
0,Avatar,CCH Pounder,Joel David Moore,Wes Studi,1000.0,936.0,855.0
1,Pirates of the Caribbean: At World's End,Johnny Depp,Orlando Bloom,Jack Davenport,40000.0,5000.0,1000.0
2,Spectre,Christoph Waltz,Rory Kinnear,Stephanie Sigman,11000.0,393.0,161.0
3,The Dark Knight Rises,Tom Hardy,Christian Bale,Joseph Gordon-Levitt,27000.0,23000.0,23000.0
4,Star Wars: Episode VII - The Force Awakens,Doug Walker,Rob Walker,NaN,131.0,12.0,NaN

In [5]:
# 创建一个自定义函数，用来改变列名，wide_to_long要求分组的变量要有相同的数字结尾
def change_col_name(col_name):
    col_name = col_name.replace('_name', '')
    if 'facebook' in col_name:
        fb_idx = col_name.find('facebook')  # 查找子字符串 'facebook' 的位置（'facebook' 从字符串 "actor_1_facebook_likes" 的第 8 个位置开始（索引从 0 开始计数）
        col_name = col_name[:5] + col_name[fb_idx - 1:] + col_name[5:fb_idx-1]  # acter + _facebook_likes + _1
    return col_name

actor2 = actor.rename(columns=change_col_name)
actor2.head()

,movie_title,actor_1,actor_2,actor_3,actor_facebook_likes_1,actor_facebook_likes_2,actor_facebook_likes_3
0,Avatar,CCH Pounder,Joel David Moore,Wes Studi,1000.0,936.0,855.0
1,Pirates of the Caribbean: At World's End,Johnny Depp,Orlando Bloom,Jack Davenport,40000.0,5000.0,1000.0
2,Spectre,Christoph Waltz,Rory Kinnear,Stephanie Sigman,11000.0,393.0,161.0
3,The Dark Knight Rises,Tom Hardy,Christian Bale,Joseph Gordon-Levitt,27000.0,23000.0,23000.0
4,Star Wars: Episode VII - The Force Awakens,Doug Walker,Rob Walker,NaN,131.0,12.0,NaN

In [6]:
# 使用wide_to_long()函数(宽格式转化为长格式)，同时stack两列actor和Facebook
stubs = ['actor', 'actor_facebook_likes']
# stubnames = stubs: stubnames是列名前缀的列表，stubs是这些列的前缀
# i = ['movie_title']: 是想保留的索引列
# j='actor_num': j表示新生成的列，这一列将包含从宽格式中提取的列的编号
# sep='_': _是分隔符
actor2_tidy = pd.wide_to_long(actor2, stubnames = stubs, i = ['movie_title'], j='actor_num', sep='_').reset_index()

actor2_tidy

,movie_title,actor_num,actor,actor_facebook_likes
0,Avatar,1,CCH Pounder,1000.0
1,Pirates of the Caribbean: At World's End,1,Johnny Depp,40000.0
2,Spectre,1,Christoph Waltz,11000.0
3,The Dark Knight Rises,1,Tom Hardy,27000.0
4,Star Wars: Episode VII - The Force Awakens,1,Doug Walker,131.0
...,...,...,...,...
14743,Signed Sealed Delivered,3,Crystal Lowe,318.0
14744,The Following,3,Sam Underwood,319.0
14745,A Plague So Pleasant,3,David Chandler,0.0
14746,Shanghai Calling,3,Eliza Coupe,489.0
14747,My Date with Drew,3,Jon Gunn,16.0

In [7]:
df = pd.read_csv('stackme.csv')
df

  State Country    a1   b2   Test  d  e
0    TX      US  0.45  0.3  Test1  2  6
1    MA      US  0.03  1.2  Test2  9  7
2    ON     CAN  0.70  4.2  Test3  4  2

In [8]:
df2 = df.rename(columns = {'a1':'group1_a1', 'b2':'group1_b2', 'd':'group2_a1', 'e':'group2_b2'})
df2.columns

Index(['State', 'Country', 'group1_a1', 'group1_b2', 'Test', 'group2_a1',
       'group2_b2'],
      dtype='object')

In [9]:
# suffix 是一个正则表达式，用于匹配列名中的后缀。'.+' 表示匹配任何字符（即列名后面的所有部分）
pd.wide_to_long(df2, stubnames=['group1', 'group2'], i=['State', 'Country', 'Test'], j='Label', suffix='.+', sep='_')

                           group1  group2
State Country Test  Label
TX    US      Test1 a1       0.45       2
                    b2       0.30       6
MA    US      Test2 a1       0.03       9
                    b2       1.20       7
ON    CAN     Test3 a1       0.70       4
                    b2       4.20       2

## 反转stacked数据

In [3]:
usecol_func = lambda x: 'ugds_' in x or x == 'instnm'
college = pd.read_csv('college.csv', index_col='instnm', usecols=usecol_func)  # usecols=usecol_func参数用于选择要加载的列
college.head()

,ugds_white,ugds_black,ugds_hisp,ugds_asian,ugds_aian,ugds_nhpi,ugds_2mor,ugds_nra,ugds_unkn
instnm,,,,,,,,,
Alabama A & M University,0.0333,0.9353,0.0055,0.0019,0.0024,0.0019,0.0000,0.0059,0.0138
University of Alabama at Birmingham,0.5922,0.2600,0.0283,0.0518,0.0022,0.0007,0.0368,0.0179,0.0100
Amridge University,0.2990,0.4192,0.0069,0.0034,0.0000,0.0000,0.0000,0.0000,0.2715
University of Alabama in Huntsville,0.6988,0.1255,0.0382,0.0376,0.0143,0.0002,0.0172,0.0332,0.0350
Alabama State University,0.0158,0.9208,0.0121,0.0019,0.0010,0.0006,0.0098,0.0243,0.0137

In [4]:
# 用stack方法，将所有水平列名转化为垂直的行索引
college_stacked = college.stack()
college_stacked.head(18)

instnm
Alabama A & M University             ugds_white    0.0333
                                     ugds_black    0.9353
                                     ugds_hisp     0.0055
                                     ugds_asian    0.0019
                                     ugds_aian     0.0024
                                     ugds_nhpi     0.0019
                                     ugds_2mor     0.0000
                                     ugds_nra      0.0059
                                     ugds_unkn     0.0138
University of Alabama at Birmingham  ugds_white    0.5922
                                     ugds_black    0.2600
                                     ugds_hisp     0.0283
                                     ugds_asian    0.0518
                                     ugds_aian     0.0022
                                     ugds_nhpi     0.0007
                                     ugds_2mor     0.0368
                                     ugds_nra      0.0179
                                     ugds_unkn     0.0100
dtype: float64

In [6]:
# 使用unstack将其还原
college_stacked.unstack().head()

,ugds_white,ugds_black,ugds_hisp,ugds_asian,ugds_aian,ugds_nhpi,ugds_2mor,ugds_nra,ugds_unkn
instnm,,,,,,,,,
Alabama A & M University,0.0333,0.9353,0.0055,0.0019,0.0024,0.0019,0.0000,0.0059,0.0138
University of Alabama at Birmingham,0.5922,0.2600,0.0283,0.0518,0.0022,0.0007,0.0368,0.0179,0.0100
Amridge University,0.2990,0.4192,0.0069,0.0034,0.0000,0.0000,0.0000,0.0000,0.2715
University of Alabama in Huntsville,0.6988,0.1255,0.0382,0.0376,0.0143,0.0002,0.0172,0.0332,0.0350
Alabama State University,0.0158,0.9208,0.0121,0.0019,0.0010,0.0006,0.0098,0.0243,0.0137

In [7]:
college2 = pd.read_csv('college.csv', usecols=usecol_func)
college2.head()

,instnm,ugds_white,ugds_black,ugds_hisp,ugds_asian,ugds_aian,ugds_nhpi,ugds_2mor,ugds_nra,ugds_unkn
0,Alabama A & M University,0.0333,0.9353,0.0055,0.0019,0.0024,0.0019,0.0000,0.0059,0.0138
1,University of Alabama at Birmingham,0.5922,0.2600,0.0283,0.0518,0.0022,0.0007,0.0368,0.0179,0.0100
2,Amridge University,0.2990,0.4192,0.0069,0.0034,0.0000,0.0000,0.0000,0.0000,0.2715
3,University of Alabama in Huntsville,0.6988,0.1255,0.0382,0.0376,0.0143,0.0002,0.0172,0.0332,0.0350
4,Alabama State University,0.0158,0.9208,0.0121,0.0019,0.0010,0.0006,0.0098,0.0243,0.0137

In [8]:
# 使用 melt，将所有 race 列变为一列
college_melted = college2.melt(id_vars='instnm', var_name='Race', value_name='Percentage')
college_melted.head()

                                instnm        Race  Percentage
0             Alabama A & M University  ugds_white      0.0333
1  University of Alabama at Birmingham  ugds_white      0.5922
2                   Amridge University  ugds_white      0.2990
3  University of Alabama in Huntsville  ugds_white      0.6988
4             Alabama State University  ugds_white      0.0158

In [10]:
# 用 pivot 还原
melted_inv = college_melted.pivot(index='instnm', columns='Race', values='Percentage')
melted_inv.head()

Race,ugds_2mor,ugds_aian,ugds_asian,ugds_black,ugds_hisp,ugds_nhpi,ugds_nra,ugds_unkn,ugds_white
instnm,,,,,,,,,
A & W Healthcare Educators,0.0000,0.0,0.0000,0.9750,0.0250,0.0,0.0000,0.0000,0.0000
A T Still University of Health Sciences,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
ABC Beauty Academy,0.0000,0.0,0.9333,0.0333,0.0333,0.0,0.0000,0.0000,0.0000
ABC Beauty College Inc,0.0000,0.0,0.0000,0.6579,0.0526,0.0,0.0000,0.0000,0.2895
AI Miami International University of Art and Design,0.0018,0.0,0.0018,0.0198,0.4773,0.0,0.0025,0.4644,0.0324

In [12]:
# 用 loc 同时选取行和列，然后重置索引，可以获得和原先索引顺序一样的 dataframe
college2_replication = melted_inv.loc[college2['instnm'], college2.columns[1:]].reset_index()
college2_replication.head()

,instnm,ugds_white,ugds_black,ugds_hisp,ugds_asian,ugds_aian,ugds_nhpi,ugds_2mor,ugds_nra,ugds_unkn
0,Alabama A & M University,0.0333,0.9353,0.0055,0.0019,0.0024,0.0019,0.0000,0.0059,0.0138
1,University of Alabama at Birmingham,0.5922,0.2600,0.0283,0.0518,0.0022,0.0007,0.0368,0.0179,0.0100
2,Amridge University,0.2990,0.4192,0.0069,0.0034,0.0000,0.0000,0.0000,0.0000,0.2715
3,University of Alabama in Huntsville,0.6988,0.1255,0.0382,0.0376,0.0143,0.0002,0.0172,0.0332,0.0350
4,Alabama State University,0.0158,0.9208,0.0121,0.0019,0.0010,0.0006,0.0098,0.0243,0.0137

In [13]:
college2.equals(college2_replication)

True

In [14]:
# 使用最外层的行索引做 unstack
college.stack().unstack(0)

instnm,Alabama A & M University,University of Alabama at Birmingham,Amridge University,University of Alabama in Huntsville,Alabama State University,The University of Alabama,Central Alabama Community College,Athens State University,Auburn University at Montgomery,Auburn University,...,MCI Institute of Technology-Boca Raton,West Coast University-Miami,National American University-Houston,Aparicio-Levy Technical College,Fred D. Learey Technical College,Hollywood Institute of Beauty Careers-West Palm Beach,Hollywood Institute of Beauty Careers-Casselberry,Coachella Valley Beauty College-Beaumont,Dewey University-Mayaguez,Coastal Pines Technical College
ugds_white,0.0333,0.5922,0.2990,0.6988,0.0158,0.7825,0.7255,0.7823,0.5328,0.8507,...,0.0199,0.1522,0.1858,0.2431,0.3731,0.2182,0.1200,0.3284,0.0,0.6762
ugds_black,0.9353,0.2600,0.4192,0.1255,0.9208,0.1119,0.2613,0.1200,0.3376,0.0704,...,0.2815,0.1739,0.6443,0.1215,0.1388,0.4182,0.3333,0.1045,0.0,0.2508
ugds_hisp,0.0055,0.0283,0.0069,0.0382,0.0121,0.0348,0.0044,0.0191,0.0074,0.0248,...,0.6854,0.6087,0.0672,0.6243,0.3080,0.2364,0.4400,0.4925,1.0,0.0359
ugds_asian,0.0019,0.0518,0.0034,0.0376,0.0019,0.0106,0.0025,0.0053,0.0221,0.0227,...,0.0132,0.0217,0.0079,0.0055,0.0000,0.0182,0.0000,0.0149,0.0,0.0045
ugds_aian,0.0024,0.0022,0.0000,0.0143,0.0010,0.0038,0.0044,0.0157,0.0044,0.0074,...,0.0000,0.0000,0.0079,0.0055,0.0000,0.0000,0.0000,0.0299,0.0,0.0034
ugds_nhpi,0.0019,0.0007,0.0000,0.0002,0.0006,0.0009,0.0000,0.0010,0.0016,0.0000,...,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0000,0.0149,0.0,0.0017
ugds_2mor,0.0000,0.0368,0.0000,0.0172,0.0098,0.0261,0.0000,0.0174,0.0297,0.0000,...,0.0000,0.0435,0.0751,0.0000,0.0022,0.0000,0.0400,0.0149,0.0,0.0191
ugds_nra,0.0059,0.0179,0.0000,0.0332,0.0243,0.0268,0.0000,0.0057,0.0397,0.0100,...,0.0000,0.0000,0.0000,0.0000,0.0000,0.0182,0.0000,0.0000,0.0,0.0028
ugds_unkn,0.0138,0.0100,0.2715,0.0350,0.0137,0.0026,0.0019,0.0334,0.0246,0.0140,...,0.0000,0.0000,0.0119,0.0000,0.1779,0.0909,0.0667,0.0000,0.0,0.0056

In [15]:
college.T

instnm,Alabama A & M University,University of Alabama at Birmingham,Amridge University,University of Alabama in Huntsville,Alabama State University,The University of Alabama,Central Alabama Community College,Athens State University,Auburn University at Montgomery,Auburn University,...,Strayer University-North Dallas,Strayer University-San Antonio,Strayer University-Stafford,WestMed College - Merced,Vantage College,SAE Institute of Technology San Francisco,Rasmussen College - Overland Park,National Personal Training Institute of Cleveland,Bay Area Medical Academy - San Jose Satellite Location,Excel Learning Center-San Antonio South
ugds_white,0.0333,0.5922,0.2990,0.6988,0.0158,0.7825,0.7255,0.7823,0.5328,0.8507,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
ugds_black,0.9353,0.2600,0.4192,0.1255,0.9208,0.1119,0.2613,0.1200,0.3376,0.0704,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
ugds_hisp,0.0055,0.0283,0.0069,0.0382,0.0121,0.0348,0.0044,0.0191,0.0074,0.0248,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
ugds_asian,0.0019,0.0518,0.0034,0.0376,0.0019,0.0106,0.0025,0.0053,0.0221,0.0227,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
ugds_aian,0.0024,0.0022,0.0000,0.0143,0.0010,0.0038,0.0044,0.0157,0.0044,0.0074,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
ugds_nhpi,0.0019,0.0007,0.0000,0.0002,0.0006,0.0009,0.0000,0.0010,0.0016,0.0000,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
ugds_2mor,0.0000,0.0368,0.0000,0.0172,0.0098,0.0261,0.0000,0.0174,0.0297,0.0000,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
ugds_nra,0.0059,0.0179,0.0000,0.0332,0.0243,0.0268,0.0000,0.0057,0.0397,0.0100,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
ugds_unkn,0.0138,0.0100,0.2715,0.0350,0.0137,0.0026,0.0019,0.0334,0.0246,0.0140,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## 分组聚合后unstacking

In [16]:
employee = pd.read_csv('employee.csv')
employee.groupby('race')['salary'].mean().astype(int)

race
Asian              65316
Black              52264
Hispanic           54811
Native American    58153
White              66611
Name: salary, dtype: int64

In [17]:
agg = employee.groupby(['race', 'sex'])['salary'].mean().astype(int)
agg

race             sex
Asian            Female    65846
                 Male      65071
Black            Female    52416
                 Male      52154
Hispanic         Female    48835
                 Male      57637
Native American  Female    48767
                 Male      61672
White            Female    66411
                 Male      66653
Name: salary, dtype: int64

In [18]:
agg.unstack('sex')

sex              Female   Male
race
Asian             65846  65071
Black             52416  52154
Hispanic          48835  57637
Native American   48767  61672
White             66411  66653

In [19]:
agg.unstack('race')

race    Asian  Black  Hispanic  Native American  White
sex
Female  65846  52416     48835            48767  66411
Male    65071  52154     57637            61672  66653

In [20]:
agg2 = employee.groupby(['race', 'sex'])['salary'].agg(['mean', 'max', 'min']).astype(int)
agg2.reset_index()

              race     sex   mean     max    min
0            Asian  Female  65846  342784  26894
1            Asian    Male  65071  342784  26915
2            Black  Female  52416  342784   9912
3            Black    Male  52154  342784  10952
4         Hispanic  Female  48835  180000   9912
5         Hispanic    Male  57637  342784  24960
6  Native American  Female  48767   99784  28205
7  Native American    Male  61672  121548  28024
8            White  Female  66411  342784   9912
9            White    Male  66653  342784  10661

In [21]:
agg2.unstack('sex')

                  mean            max            min
sex             Female   Male  Female    Male Female   Male
race
Asian            65846  65071  342784  342784  26894  26915
Black            52416  52154  342784  342784   9912  10952
Hispanic         48835  57637  180000  342784   9912  24960
Native American  48767  61672   99784  121548  28205  28024
White            66411  66653  342784  342784   9912  10661

## 用分组聚合实现透视表

In [28]:
flights = pd.read_csv('flights.csv', parse_dates=['date'])
flights.head()

,date,airline,origin,dest,dep_time,arr_time,cancelled,air_time,distance,carrier_delay,weather_delay,nas_delay,security_delay,late_aircraft_delay
0,2018-01-01,UA,LAS,IAH,100,547,0,134.0,1222.0,0,0,0,0,0
1,2018-01-01,WN,DEN,PHX,515,720,0,91.0,602.0,0,0,0,0,0
2,2018-01-01,B6,JFK,BOS,550,657,0,39.0,187.0,0,83,8,0,0
3,2018-01-01,B6,DTW,BOS,600,754,0,79.0,632.0,0,0,19,0,0
4,2018-01-01,UA,LAS,EWR,600,1348,0,261.0,2227.0,0,0,0,0,0

In [29]:
# 用 pivot_table() 方法求出每条航线每个始发地的被取消的航班总数
# flights.pivot_table(...): 这是Pandas中用于创建透视表的函数
# index='airline': index指定了透视表的行索引
# columns='origin': columns指定了透视表的列索引
# values='cancelled': values指定了要聚合的列
# aggfunc='sum': aggfunc指定了聚合函数，用来对指定列进行计算
# fill_value=0: fill_value指定了透视表中缺失值的填充值
fp = flights.pivot_table(index='airline', columns='origin', values='cancelled', aggfunc='sum', fill_value=0).round(2)
fp.head()

origin,ATL,BOS,CLT,DCA,DEN,DFW,DTW,EWR,IAH,JFK,LAS,LAX,LGA,MCO,MSP,ORD,PHL,PHX,SEA,SFO
airline,,,,,,,,,,,,,,,,,,,,
9E,0,5,6,1,0,1,1,2,0,10,0,0,3,0,1,6,0,0,0,0
AA,5,41,33,27,3,33,4,10,7,6,8,12,21,8,4,38,24,8,0,5
AS,0,1,0,0,1,0,0,6,0,3,5,5,0,0,0,0,0,1,9,9
B6,2,31,2,3,0,0,3,8,0,17,4,1,2,12,0,1,3,0,0,1
DL,19,9,1,3,0,1,8,0,1,3,1,2,8,6,2,3,2,1,2,0

In [30]:
fg = flights.groupby(['airline', 'origin'])['cancelled'].sum()
fg.head()

airline  origin
9E       ATL       0
         BOS       5
         CLT       6
         DCA       1
         DFW       1
Name: cancelled, dtype: int64

In [31]:
fg_unstack = fg.unstack('origin', fill_value=0)
fg_unstack.head()

origin,ATL,BOS,CLT,DCA,DEN,DFW,DTW,EWR,IAH,JFK,LAS,LAX,LGA,MCO,MSP,ORD,PHL,PHX,SEA,SFO
airline,,,,,,,,,,,,,,,,,,,,
9E,0,5,6,1,0,1,1,2,0,10,0,0,3,0,1,6,0,0,0,0
AA,5,41,33,27,3,33,4,10,7,6,8,12,21,8,4,38,24,8,0,5
AS,0,1,0,0,1,0,0,6,0,3,5,5,0,0,0,0,0,1,9,9
B6,2,31,2,3,0,0,3,8,0,17,4,1,2,12,0,1,3,0,0,1
DL,19,9,1,3,0,1,8,0,1,3,1,2,8,6,2,3,2,1,2,0

In [32]:
fp.equals(fg_unstack)

True

In [33]:
# 实现一个稍微复杂点的透视表

flights['month'] = flights['date'].dt.month
fp2 = flights.pivot_table(index=['airline', 'month'], columns=['origin', 'cancelled'], 
                          values=['dep_time', 'distance'], aggfunc=[np.mean, np.sum], fill_value=0)
fp2.head()

C:\Users\Administrator\AppData\Local\Temp\ipykernel_26784\2100803209.py:4: FutureWarning: The provided callable <function mean at 0x000001A97FE46FC0> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  fp2 = flights.pivot_table(index=['airline', 'month'], columns=['origin', 'cancelled'],
C:\Users\Administrator\AppData\Local\Temp\ipykernel_26784\2100803209.py:4: FutureWarning: The provided callable <function sum at 0x000001A97FE45BC0> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  fp2 = flights.pivot_table(index=['airline', 'month'], columns=['origin', 'cancelled'],

                  mean                                                 \
              dep_time
origin             ATL               BOS                  CLT
cancelled            0    1            0       1            0       1
airline month
9E      1        730.0  0.0  1305.000000  1325.0  1265.300000     0.0
        2        730.0  0.0  1274.166667     0.0  1399.000000     0.0
        3        729.0  0.0  1455.000000     0.0  1410.444444  1900.0
        4          0.0  0.0  1487.857143     0.0  1132.400000  1718.0
        5        732.0  0.0  1402.142857  1935.0  1345.857143  1600.0

                                             ...      sum                     \
                                             ... distance
origin                 DCA         DEN       ...      ORD           PHL
cancelled                0      1    0    1  ...        0       1     0    1
airline month                                ...
9E      1      1163.000000    0.0  0.0  0.0  ...   4368.0  1480.0  94.0  0.0
        2       917.142857    0.0  0.0  0.0  ...   4774.0     0.0   0.0  0.0
        3      1400.000000  915.0  0.0  0.0  ...   3195.0  1480.0   0.0  0.0
        4      1350.000000    0.0  0.0  0.0  ...   3123.0     0.0   0.0  0.0
        5       986.666667    0.0  0.0  0.0  ...   3024.0     0.0   0.0  0.0



origin         PHX       SEA       SFO
cancelled        0    1    0    1    0    1
airline month
9E      1      0.0  0.0  0.0  0.0  0.0  0.0
        2      0.0  0.0  0.0  0.0  0.0  0.0
        3      0.0  0.0  0.0  0.0  0.0  0.0
        4      0.0  0.0  0.0  0.0  0.0  0.0
        5      0.0  0.0  0.0  0.0  0.0  0.0

[5 rows x 160 columns]

In [36]:
flights.groupby(['airline', 'month', 'origin', 'cancelled'])[['dep_time', 'distance']]\
        .agg(['mean', 'sum'])

                                   dep_time           distance
                                       mean    sum        mean      sum
airline month origin cancelled
9E      1     ATL    0           730.000000    730  689.000000    689.0
              BOS    0          1305.000000   3915  187.000000    561.0
                     1          1325.000000   1325  187.000000    187.0
              CLT    0          1265.300000  12653  538.400000   5384.0
              DCA    0          1163.000000   5815  213.000000   1065.0
...                                     ...    ...         ...      ...
YX      12    LGA    0          1333.000000  41323  500.290323  15509.0
                     1           800.000000    800  214.000000    214.0
              MSP    0          1191.933333  17879  887.000000  13305.0
              ORD    0          1417.000000  28340  533.650000  10673.0
              PHL    0          1715.777778  15442  304.555556   2741.0

[3114 rows x 4 columns]

In [37]:
flights.groupby(['airline', 'month', 'origin', 'cancelled'])[['dep_time', 'distance']]\
        .agg(['mean', 'sum']).unstack(['origin', 'cancelled'], fill_value=0)

                  dep_time                                                    \
                      mean
origin                 ATL                  BOS                  CLT
cancelled                0       1            0       1            0       1
airline month
9E      1       730.000000     0.0  1305.000000  1325.0  1265.300000     0.0
        2       730.000000     0.0  1274.166667     0.0  1399.000000     0.0
        3       729.000000     0.0  1455.000000     0.0  1410.444444  1900.0
        4         0.000000     0.0  1487.857143     0.0  1132.400000  1718.0
        5       732.000000     0.0  1402.142857  1935.0  1345.857143  1600.0
...                    ...     ...          ...     ...          ...     ...
YX      8      1311.900000  1429.5  1066.666667  1875.0  1378.888889  1610.0
        9      1176.400000  2047.0  1133.333333     0.0  1154.294118     0.0
        10     1308.733333     0.0  1416.666667     0.0  1310.285714     0.0
        11     1392.062500     0.0  1260.000000     0.0  1307.333333     0.0
        12     1284.647059     0.0  1146.714286     0.0  1167.785714     0.0

                                                           ... distance  \
                                                           ...      sum
origin                 DCA                       DEN       ...      ORD
cancelled                0            1            0    1  ...        0
airline month                                              ...
9E      1      1163.000000     0.000000     0.000000  0.0  ...   4368.0
        2       917.142857     0.000000     0.000000  0.0  ...   4774.0
        3      1400.000000   915.000000     0.000000  0.0  ...   3195.0
        4      1350.000000     0.000000     0.000000  0.0  ...   3123.0
        5       986.666667     0.000000     0.000000  0.0  ...   3024.0
...                    ...          ...          ...  ...  ...      ...
YX      8      1478.661017  1828.333333  1065.400000  0.0  ...  12278.0
        9      1458.610169  1880.000000  1277.500000  0.0  ...   6084.0
        10     1433.561404     0.000000  1433.333333  0.0  ...   5467.0
        11     1355.170213  1723.000000  1170.000000  0.0  ...   2893.0
        12     1493.575000     0.000000  1403.250000  0.0  ...  10673.0



origin                    PHL       PHX       SEA       SFO
cancelled           1       0    1    0    1    0    1    0    1
airline month
9E      1      1480.0    94.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
        2         0.0     0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
        3      1480.0     0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
        4         0.0     0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
        5         0.0     0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
...               ...     ...  ...  ...  ...  ...  ...  ...  ...
YX      8      1198.0   929.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
        9         0.0   810.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
        10        0.0     0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
        11        0.0   119.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
        12        0.0  2741.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0

[183 rows x 160 columns]

In [35]:
# .swaplevel(0, 1, axis='columns'):swaplevel 方法用于交换列的多层索引的级别。在这里，0 和 1 代表列索引的层级。axis='columns' 表示操作发生在列索引上，而不是行索引。
# 交换层级后，列的顺序会发生变化，原本位于第二层（'origin'）的列会变到第一层，原本位于第一层（'cancelled'）的列会变到第二层。
flights.groupby(['airline', 'month', 'origin', 'cancelled'])[['dep_time', 'distance']]\
        .agg(['mean', 'sum']).unstack(['origin', 'cancelled'], fill_value=0) \
        .swaplevel(0, 1, axis='columns') \
        .head()

                  mean                                                 \
              dep_time
origin             ATL               BOS                  CLT
cancelled            0    1            0       1            0       1
airline month
9E      1        730.0  0.0  1305.000000  1325.0  1265.300000     0.0
        2        730.0  0.0  1274.166667     0.0  1399.000000     0.0
        3        729.0  0.0  1455.000000     0.0  1410.444444  1900.0
        4          0.0  0.0  1487.857143     0.0  1132.400000  1718.0
        5        732.0  0.0  1402.142857  1935.0  1345.857143  1600.0

                                             ...      sum                     \
                                             ... distance
origin                 DCA         DEN       ...      ORD           PHL
cancelled                0      1    0    1  ...        0       1     0    1
airline month                                ...
9E      1      1163.000000    0.0  0.0  0.0  ...   4368.0  1480.0  94.0  0.0
        2       917.142857    0.0  0.0  0.0  ...   4774.0     0.0   0.0  0.0
        3      1400.000000  915.0  0.0  0.0  ...   3195.0  1480.0   0.0  0.0
        4      1350.000000    0.0  0.0  0.0  ...   3123.0     0.0   0.0  0.0
        5       986.666667    0.0  0.0  0.0  ...   3024.0     0.0   0.0  0.0



origin         PHX       SEA       SFO
cancelled        0    1    0    1    0    1
airline month
9E      1      0.0  0.0  0.0  0.0  0.0  0.0
        2      0.0  0.0  0.0  0.0  0.0  0.0
        3      0.0  0.0  0.0  0.0  0.0  0.0
        4      0.0  0.0  0.0  0.0  0.0  0.0
        5      0.0  0.0  0.0  0.0  0.0  0.0

[5 rows x 160 columns]

## 为了更容易reshaping，重新命名索引层

In [39]:
college = pd.read_csv('college.csv')

cg = college.groupby(['stabbr', 'relaffil'])[['ugds', 'satmtmid']] \
            .agg(['count', 'min', 'max']).head(6)
cg

                 ugds                 satmtmid
                count    min      max    count    min    max
stabbr relaffil
AK     0            7  109.0  12865.0        0    NaN    NaN
       1            3   27.0    275.0        1  503.0  503.0
AL     0           71   12.0  29851.0       13  420.0  590.0
       1           18   13.0   3033.0        8  400.0  560.0
AR     0           68   18.0  21405.0        9  427.0  565.0
       1           14   20.0   4485.0        7  495.0  600.0

In [40]:
cg = cg.rename_axis(['AGG_COLS', 'AGG_FUNCS'], axis='columns')
cg

AGG_COLS         ugds                 satmtmid
AGG_FUNCS       count    min      max    count    min    max
stabbr relaffil
AK     0            7  109.0  12865.0        0    NaN    NaN
       1            3   27.0    275.0        1  503.0  503.0
AL     0           71   12.0  29851.0       13  420.0  590.0
       1           18   13.0   3033.0        8  400.0  560.0
AR     0           68   18.0  21405.0        9  427.0  565.0
       1           14   20.0   4485.0        7  495.0  600.0

In [41]:
cg.stack('AGG_FUNCS').head()

C:\Users\Administrator\AppData\Local\Temp\ipykernel_26784\1357301776.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  cg.stack('AGG_FUNCS').head()

AGG_COLS                      ugds  satmtmid
stabbr relaffil AGG_FUNCS
AK     0        count          7.0       0.0
                min          109.0       NaN
                max        12865.0       NaN
       1        count          3.0       1.0
                min           27.0     503.0

In [43]:
cg.stack('AGG_FUNCS').swaplevel('AGG_FUNCS', 'stabbr', axis='index').head()

C:\Users\Administrator\AppData\Local\Temp\ipykernel_26784\1883621572.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  cg.stack('AGG_FUNCS').swaplevel('AGG_FUNCS', 'stabbr', axis='index').head()

AGG_COLS                      ugds  satmtmid
AGG_FUNCS relaffil stabbr
count     0        AK          7.0       0.0
min       0        AK        109.0       NaN
max       0        AK      12865.0       NaN
count     1        AK          3.0       1.0
min       1        AK         27.0     503.0

In [45]:
# .sort_index(level='relaffil', axis='index'): 对 relaffil 索引排序
cg.stack('AGG_FUNCS')\
  .swaplevel('AGG_FUNCS', 'stabbr',axis='index') \
  .sort_index(level='relaffil', axis='index') \
  .sort_index(level='AGG_COLS', axis='columns').head(6)

C:\Users\Administrator\AppData\Local\Temp\ipykernel_26784\2258432450.py:2: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  cg.stack('AGG_FUNCS')\

AGG_COLS                   satmtmid     ugds
AGG_FUNCS relaffil stabbr
count     0        AK           0.0      7.0
                   AL          13.0     71.0
                   AR           9.0     68.0
max       0        AK           NaN  12865.0
                   AL         590.0  29851.0
                   AR         565.0  21405.0

In [46]:
cg.stack('AGG_FUNCS').unstack(['relaffil', 'stabbr'])

C:\Users\Administrator\AppData\Local\Temp\ipykernel_26784\3995304890.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  cg.stack('AGG_FUNCS').unstack(['relaffil', 'stabbr'])

AGG_COLS      ugds                                          satmtmid         \
relaffil         0      1        0       1        0       1        0      1
stabbr          AK     AK       AL      AL       AR      AR       AK     AK
AGG_FUNCS
count          7.0    3.0     71.0    18.0     68.0    14.0      0.0    1.0
min          109.0   27.0     12.0    13.0     18.0    20.0      NaN  503.0
max        12865.0  275.0  29851.0  3033.0  21405.0  4485.0      NaN  503.0

AGG_COLS
relaffil       0      1      0      1
stabbr        AL     AL     AR     AR
AGG_FUNCS
count       13.0    8.0    9.0    7.0
min        420.0  400.0  427.0  495.0
max        590.0  560.0  565.0  600.0

In [47]:
cg.stack(['AGG_FUNCS', 'AGG_COLS']).head(12)

C:\Users\Administrator\AppData\Local\Temp\ipykernel_26784\3178484617.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  cg.stack(['AGG_FUNCS', 'AGG_COLS']).head(12)

stabbr  relaffil  AGG_FUNCS  AGG_COLS
AK      0         count      ugds            7.0
                             satmtmid        0.0
                  min        ugds          109.0
                  max        ugds        12865.0
        1         count      ugds            3.0
                             satmtmid        1.0
                  min        ugds           27.0
                             satmtmid      503.0
                  max        ugds          275.0
                             satmtmid      503.0
AL      0         count      ugds           71.0
                             satmtmid       13.0
dtype: float64

In [48]:
cg.rename_axis([None, None], axis='index').rename_axis([None, None], axis='columns')

      ugds                 satmtmid
     count    min      max    count    min    max
AK 0     7  109.0  12865.0        0    NaN    NaN
   1     3   27.0    275.0        1  503.0  503.0
AL 0    71   12.0  29851.0       13  420.0  590.0
   1    18   13.0   3033.0        8  400.0  560.0
AR 0    68   18.0  21405.0        9  427.0  565.0
   1    14   20.0   4485.0        7  495.0  600.0

## 当多个变量被存储为列名时进行清理

In [49]:
weightlifting = pd.read_csv('weightlifting_men.csv')
weightlifting

,Weight Category,M35 35-39,M40 40-44,M45 45-49,M50 50-54,M55 55-59,M60 60-64,M65 65-69,M70 70-74,M75 75-79,M80 80+
0,56,137,130,125,115,102,92,80,67,62,55
1,62,152,145,137,127,112,102,90,75,67,57
2,69,167,160,150,140,125,112,97,82,75,60
3,77,182,172,165,150,135,122,107,90,82,65
4,85,192,182,175,160,142,130,112,95,87,70
5,94,202,192,182,167,150,137,120,100,90,75
6,105,210,200,190,175,157,142,122,102,95,80
7,105+,217,207,197,182,165,150,127,107,100,85

In [50]:
wl_melt = weightlifting.melt(id_vars='Weight Category', var_name='sex_age', value_name='Qual Total')
wl_melt.head()

  Weight Category    sex_age  Qual Total
0              56  M35 35-39         137
1              62  M35 35-39         152
2              69  M35 35-39         167
3              77  M35 35-39         182
4              85  M35 35-39         192

In [51]:
len(weightlifting), len(wl_melt)

(8, 80)

In [52]:
sex_age = wl_melt['sex_age'].str.split(expand=True)  # split 默认以空格为分隔符， expand=True: expand 参数的作用是将分割后的结果展开成多个列
sex_age.head()

     0      1
0  M35  35-39
1  M35  35-39
2  M35  35-39
3  M35  35-39
4  M35  35-39

In [53]:
sex_age.columns = ['Sex', 'Age Group']
sex_age.head()

   Sex Age Group
0  M35     35-39
1  M35     35-39
2  M35     35-39
3  M35     35-39
4  M35     35-39

In [54]:
sex_age['Sex'] = sex_age['Sex'].str[0]
sex_age.head()

  Sex Age Group
0   M     35-39
1   M     35-39
2   M     35-39
3   M     35-39
4   M     35-39

In [56]:
# 用 concat 方法，将 sex_age 和 wl_cat_total 两个 DataFrame 拼接起来
wl_cat_total = wl_melt[['Weight Category', 'Qual Total']]
wl_tidy = pd.concat([sex_age, wl_cat_total], axis='columns')
wl_tidy.head()

  Sex Age Group Weight Category  Qual Total
0   M     35-39              56         137
1   M     35-39              62         152
2   M     35-39              69         167
3   M     35-39              77         182
4   M     35-39              85         192

In [60]:
# 也可以这样拼接
cols = ['Weight Category', 'Qual Total']
sex_age[cols] = wl_melt[cols]
sex_age.head()

  Sex Age Group Weight Category  Qual Total
0   M     35-39              56         137
1   M     35-39              62         152
2   M     35-39              69         167
3   M     35-39              77         182
4   M     35-39              85         192

In [62]:
# 也可以通过assign的方法，动态加在新的列

# \d{2}：匹配两个数字，表示年龄的开始部分。
# [-+]：匹配连接符，可以是 - 或 +，用于连接年龄的范围（如 "25-34" 或 "45+50"）。
# (?:\d{2})?：匹配一个可选的两个数字，表示年龄段的结束部分。这部分用非捕获分组 (?:) 来处理，表示它不需要单独提取出来
age_group = wl_melt.sex_age.str.extract('(\d{2}[-+](?:\d{2})?)', expand=False)
sex = wl_melt.sex_age.str[0]
new_cols = {'Sex':sex, 'Age Group': age_group}

wl_tidy2 = wl_melt.assign(**new_cols).drop('sex_age', axis='columns')  # assign()：这是 Pandas 中的一个方法，用于向 DataFrame 添加新列或修改现有列
wl_tidy2.head()

<>:6: SyntaxWarning: invalid escape sequence '\d'
<>:6: SyntaxWarning: invalid escape sequence '\d'
C:\Users\Administrator\AppData\Local\Temp\ipykernel_26784\1865735977.py:6: SyntaxWarning: invalid escape sequence '\d'
  age_group = wl_melt.sex_age.str.extract('(\d{2}[-+](?:\d{2})?)', expand=False)

  Weight Category  Qual Total Sex Age Group
0              56         137   M     35-39
1              62         152   M     35-39
2              69         167   M     35-39
3              77         182   M     35-39
4              85         192   M     35-39

In [63]:
wl_tidy2.sort_index(axis=1).equals(wl_tidy.sort_index(axis=1))

True

## 当多个变量被存储为列的值时进行清理

In [ ]:
inspections = pd.read_csv('data/restaurant_inspections.csv', parse_dates=['Date'])
inspections.head(10)

In [ ]:
inspections.pivot(index=['Name', 'Date'], columns='Info', values='Value')

In [ ]:
inspections.set_index(['Name','Date', 'Info']).head(10)

In [ ]:
inspections.set_index(['Name','Date', 'Info']).unstack('Info').head()

In [ ]:
insp_tidy = inspections.set_index(['Name','Date', 'Info'])\
                        .unstack('Info') \
                        .rename_axis(columns=None) \
                        .reset_index(col_level=-1)
insp_tidy.head()

In [ ]:
insp_tidy.columns = insp_tidy.columns.droplevel(0).rename(None)
insp_tidy.head()

In [ ]:
inspections.set_index(['Name','Date','Info']) \
            .squeeze() \
            .unstack('Info') \
            .reset_index() \
            .rename_axis(None, axis='columns')

In [ ]:
inspections.pivot_table(index=['Name','Date'], columns='Info', values='Value', aggfunc='first') \
            .reset_index()\
            .rename_axis(None, axis='columns')

## 当两个或多个值存储于一个单元格时进行清理

In [ ]:
cities = pd.read_csv('data/texas_cities.csv')
cities

In [ ]:
geolocations = cities.Geolocation.str.split(pat='. ', expand=True)
geolocations.columns = ['latitude', 'latitude direction', 'longitude', 'longitudedirection']
geolocations

In [ ]:
geolocations = geolocations.astype({'latitude':'float', 'longitude':'float'})
geolocations.dtypes

In [ ]:
cities_tidy = pd.concat([cities['City'], geolocations], axis='columns')
cities_tidy

In [ ]:
temp = geolocations.apply(pd.to_numeric, errors='ignore')
temp

In [ ]:
temp.dtypes

In [ ]:
cities.Geolocation.str.split(pat='° |,', expand=True)

In [ ]:
cities.Geolocation.str.extract('([0-9.]+). (N|S), ([0-9.]+). (E|W)', expand=True)

## 当多个变量被存储为列名和列值时进行清理

In [ ]:
sensors = pd.read_csv('data/sensors.csv')
sensors

In [ ]:
sensors.melt(id_vars=['Group', 'Property'], var_name='Year').head(6)

In [ ]:
sensors.melt(id_vars=['Group', 'Property'], var_name='Year') \
        .pivot_table(index=['Group', 'Year'], columns='Property', values='value') \
        .reset_index() \
        .rename_axis(None, axis='columns')

In [ ]:
sensors.set_index(['Group', 'Property']) \
        .stack() \
        .unstack('Property') \
        .rename_axis(['Group', 'Year'], axis='index') \
        .rename_axis(None, axis='columns') \
        .reset_index()

## 当多个观察单位被存储于同一张表时进行清理

In [ ]:
movie = pd.read_csv('movie_altered.csv')
movie.head()

In [ ]:
movie.insert(0, 'id', np.arange(len(movie)))
movie.head()

In [ ]:
stubnames = ['director', 'director_fb_likes', 'actor', 'actor_fb_likes']
movie_long = pd.wide_to_long(movie, stubnames=stubnames, i='id', j='num', sep='_').reset_index()
movie_long['num'] = movie_long['num'].astype(int)
movie_long.head(9)

In [ ]:
movie_table = movie_long[['id','title', 'year', 'duration', 'rating']]
director_table = movie_long[['id', 'director', 'num', 'director_fb_likes']]
actor_table = movie_long[['id', 'actor', 'num', 'actor_fb_likes']]
movie_table.head(9)

In [ ]:
director_table.head(9)

In [ ]:
actor_table.head(9)

In [ ]:
movie_table = movie_table.drop_duplicates().reset_index(drop=True)
director_table = director_table.dropna().reset_index(drop=True)
actor_table = actor_table.dropna().reset_index(drop=True)
movie_table.head()

In [ ]:
director_table.head()

In [ ]:
movie.memory_usage(deep=True).sum()

In [ ]:
movie_table.memory_usage(deep=True).sum() + \
director_table.memory_usage(deep=True).sum() +\
actor_table.memory_usage(deep=True).sum()

In [ ]:
director_cat = pd.Categorical(director_table['director'])
director_table.insert(1,'director_id', director_cat.codes)
actor_cat = pd.Categorical(actor_table['actor'])
actor_table.insert(1, 'actor_id', actor_cat.codes)
director_table.head()

In [ ]:
actor_table.head()

In [ ]:
director_associative = director_table[['id', 'director_id', 'num']]
dcols = ['director_id', 'director', 'director_fb_likes']
director_unique = director_table[dcols].drop_duplicates().reset_index(drop=True)
director_associative.head()

In [ ]:
director_unique.head()

In [ ]:
actor_associative = actor_table[['id', 'actor_id', 'num']]
acols = ['actor_id', 'actor', 'actor_fb_likes']
actor_unique = actor_table[acols].drop_duplicates().reset_index(drop=True)
actor_associative.head()

In [ ]:
actor_unique.head()

In [ ]:
movie_table.memory_usage(deep=True).sum() + \
director_associative.memory_usage(deep=True).sum() + \
director_unique.memory_usage(deep=True).sum() + \
actor_associative.memory_usage(deep=True).sum()+ \
actor_unique.memory_usage(deep=True).sum()

In [ ]:
movie_table.head()

In [ ]:
actors = actor_associative.merge(actor_unique, on='actor_id') \
                            .drop('actor_id', 1) \
                            .pivot_table(index='id', columns='num', aggfunc='first')

actors.columns = actors.columns.get_level_values(0) + '_' + \
                 actors.columns.get_level_values(1).astype(str)

directors = director_associative.merge(director_unique, on='director_id') \
                                .drop('director_id', 1) \
                                .pivot_table(index='id', columns='num', aggfunc='first')

directors.columns = directors.columns.get_level_values(0) + '_' + \
directors.columns.get_level_values(1).astype(str)

In [ ]:
actors.head()

In [ ]:
directors.head()

In [ ]:
movie2 = movie_table.merge(directors.reset_index(), on='id', how='left') \
                    .merge(actors.reset_index(), on='id', how='left') \
                    .merge(actors.reset_index(), on='id', how='left')
movie2.head()

In [ ]:
movie.equals(movie2[movie.columns])

In [5]:
532+18

550